app/Controllers/StudentsController.php

    public function index()
    {
        $search = $this->request->getGet('search'); // Get the search query
        $studentModel = new StudentsModel();

        if ($search) {
            // Search by name, year, section, or course
            $students = $studentModel->like('student_name', $search)
                                     ->orLike('student_year', $search)
                                     ->orLike('student_section', $search)
                                     ->orLike('student_course', $search)
                                     ->where('is_deleted', 0) // Ensure soft-deleted students are excluded
                                     ->findAll();
        } else {
            // Fetch all students if no search query
            $students = $studentModel->where('is_deleted', 0)->findAll();
---
SELECT *
FROM `tbl_students`
WHERE `is_deleted` = 0

    public function search()
    {
        $query = $this->request->getGet('query');
        $studentModel = new StudentsModel();

        if ($query) {
            $students = $studentModel->like('student_name', $query)
                                     ->orLike('student_year', $query)
                                     ->orLike('student_section', $query)
                                     ->orLike('student_course', $query)
                                     ->where('is_deleted', 0)
                                     ->findAll();
        } else {
            $students = $studentModel->where('is_deleted', 0)->findAll();
---
SELECT *
FROM `tbl_students`
WHERE `student_name` LIKE '%j%' ESCAPE '!'
OR  `student_year` LIKE '%j%' ESCAPE '!'
OR  `student_section` LIKE '%j%' ESCAPE '!'
OR  `student_course` LIKE '%j%' ESCAPE '!'
AND `is_deleted` = 0
SELECT *
FROM `tbl_students`
WHERE `is_deleted` = 0